[
  {
    "concern_id": 10101,
    "concern_title": "Water",
    "concern_img": "../../images/water.jpg",
    "concern_data": "Having clean water is a right that all Canadians have. Many properties around that watershed access surface or well water. With the proposed mine location, there is increased risk that runoff from the mine could contaminate that watershed, either immediately or in the future. This could result in homeowners bearing the costs of finding an alternative way to get clean water. In addition, water is already scarce in the Rossland area during the summer months. If the proposed mine requires the use of any water, this will add significant pressure to an already taxed system. Along with risking the drinking water of residents, the proposed mine could also destroy fish habitat and the water supply for the wildlife in the area. Under the Water Sustainability Act, everyone needs a water license. How will the watershed be protected, monitored, and sustained? What measures will the province put in place to ensure current and future protection of that watershed?"
  },
  {
    "concern_id": 10102,
    "concern_title": "Asbestos and Other Airborne Chemicals",
    "concern_img": "../../images/air.jpg",
    "concern_data": "Within the ore there are proven traces of asbestos. With trucks driving through the center of town, estimated at every 7-10 minutes, 7 days per week, the exposure to asbestos, or other chemicals in the ore dust, is possible. Any exposure to asbestos is a serious health risk. The tests that have been done, although they might be according to the minimum regulations, are not enough to ensure the exposure to asbestos is not a threat to our communities.How will the government evaluate the contradicting reports of asbestos at the mine site? How will the government monitor potential asbestos contamination at the mine site and in the transport trucks traveling through our communities? How will dust be monitored for such chemicals?    "
  },
  {
    "concern_id": 10103,
    "concern_title": "Noise Pollution",
    "concern_img": "../../images/bombing.jpg",
    "concern_data": "The noise from weekly blasting and daily crushing and hauling on a mine site that is 7.5 kilometers from the community of Rossland and only 2 kilometers from the community of Paterson will have an extremely negative impact on the quality of life for all residents. Moreover, the proposed mine site is only 200 meters from our epic trail, Seven Summits, which is traversed by locals and tourists daily. This noise will affect the patrons of the trail significantly. In addition, the noise pollution from the heavy truck traffic through Rossland, Paterson, and Trail will negatively impact all residents. What will the province do to mitigate this noise in our communities? How can the mine site be altered to buffer sound? Is it possible to reduce hours of operation, including hauling, to be consistent with a typical work schedule, thus permitting some regard for residents?"
  },
  {
    "concern_id": 10104,
    "concern_title": "Transportation of Ore",
    "concern_img": "../../images/rockTruck.jpg",
    "concern_data": "With the proposed 80 ore-truck-trips a day throughout Paterson and Rossland I am specifically concerned about road infrastructure and the safety for citizens. The town of Rossland will carry the burden of the heavy traffic throughout town, affecting businesses, residents, and homeowners. If the trucks are rerouted through Paterson, that community will be negatively impacted. It is a farming community with tractors and equipment sharing the road. How will the province ensure safety of community members, mitigate the negative impact of increased heavy traffic on tourism, and reduce potential noise from the big trucks?  In addition, the dust generated by the ore trucks hauling material on the gravel road of cascade highway and through communities has the potential to greatly affect air quality. It could also create a blanket of dust on residents homes, community sidewalks, and storefronts. As queried earlier, how will the province ensure dust from the ore trucks is mitigated? And how will the province ensure that the homes and communities are kept clean?"
  },
  {
    "concern_id": 10105,
    "concern_title": "Economic Impacts",
    "concern_img": "../../images/money.jpg",
    "concern_data": "Rossland has been named one of the best small mountain towns in Canada to live in,  according to Map Quest Travel, and has worked hard to establish itself as a travel and tourist destination.. Rossland accommodation revenue from tourism reached a record in 2022, where “Total accommodation revenue was $9.5 million, a 40 per cent increase over the best year prior to the pandemic in 2019.” (Rossland News May 26, 2023). Rossland residents have invested significantly over the last 20+ years in the city center and surrounding trails, parks and recreation areas to become a four season outdoor recreation destination. Many shops and services, and the economic activity in general, is focused on catering to this market. Many of the residents of Rossland choose to live here because of the quality of life that the area offers (ie, close access to wild nature, peace and quiet, clean water, calm streets, world class winter and summer recreation possibilities, including trails that are tourist attractions). Rossland is a popular tourist destination for mountain biking and all types of skiing. In 2012, Rossland was named the “Mountain Biking Capital of Canada'' by Explore Magazine. Tourism in Rossland in 2011, recorded that out-of-town mountain bikers spent a total of $589,000, which significantly contributed to the community’s revenues and added to provincial revenues (Tourism BC, 2013). Since that time, mountain biking revenues have continued to climb and are a major contributing factor for the local economy and community."
  },
  {
    "concern_id": 10106,
    "concern_title": "Farm Land",
    "concern_img": "../../images/farmland.jpg",
    "concern_data": "Paterson and Sheep Creek areas are home to some of the only viable farmland Rossland has access to. This land is not protected by the ALR. This agricultural land is at risk of being negatively impacted by noise, dust, and water pollution. How will the province ensure that the impact of the mine will not affect agricultural production of this land and mitigate the effects of dust, noise, and water pollution for the cattle, horses, and poultry of these farms?"
  },
  {
    "concern_id": 10107,
    "concern_title": "First Nations’ Land Rights & UNDRIP",
    "concern_img": "../../images/firstNations.jpg",
    "concern_data": "This proposed mine directly impacts the Sinixt people and their future generations. It is their land we call home and it is their right to protect it. This is their traditional unceded territory and they need to be meaningfully consulted.  A representative of the Sinixt came to the community open house in Rossland on the evening of May 17th to express in very strong and heartfelt words that the band DOES NOT WANT IT. How will the province ensure that these indigenous people’s voices are considered?"
  },
  {
    "concern_id": 10108,
    "concern_title": "Endangered species & unique ecosystem",
    "concern_img": "../../images/grassland.jpeg",
    "concern_data": "The grassland deserves further study and has culturally significant flora and endangered plant species. There is a SARA S1 listed plant.  How will the province ensure that the ecosystem at Record Ridge is protected?"
  },
  {
    "concern_id": 10109,
    "concern_title": "Safety",
    "concern_img": "../../images/safety.jpg",
    "concern_data": "The safety of people driving, hiking, and cycling along the Cascade Highway has not been considered. “Highway” is a misnomer for this gravel road, designed, as one man who attended the Open House said, “for Model-T and horse drawn wagon.” This road features narrow segments, blind corners, and precipitous drop offs. In addition, increased truck traffic through the centre of town,  would further endanger the safety of drivers and pedestrians alike."
  },
  {
    "concern_id": 10110,
    "concern_title": "Application Period",
    "concern_img": "../../images/time.jpg",
    "concern_data": "WHY has limited their application and the information provided to a 2 year pilot project with extraction of only 249,000 tons of ore, to avoid the threshold of a large-scale environmental assessment. The proponents told the community that they intend to expand the mine site with additional applications after two years. The community would like to know, prior to any pilot, the full scope of the project and the effect it could have in their lives and future generations. The potential hidden social, environmental, and economic costs of this mine in the short and long term should be considered when planning this project that will affect the life of “Beautiful British Columbia” citizens. How can the province balance the right of the applicant to just a two year mining proposal and ensure the local communities receive  informed consent for a potentially longer term and more invasive project?"
  },
  {
    "concern_id": 10111,
    "concern_title": "Dust",
    "concern_img": "../../images/dust.jpg",
    "concern_data": "The amount of dust that will be created from the blasting, crushing, loading and hauling activity will be significant. The local residents living nearest the mine site, such as those families in Paterson, will be constantly exposed to dust and airborne chemicals in the dust. How will dust be mitigated at the mine site? How will the dust be monitored for harmful contaminants? How will the province ensure local residents have their homes, vehicles, and yards regularly cleaned from excess dust from mining activity?"
  }
]
